
import MyMessage from "./MyMessage";
import MessageInfo from "./Message-Info";
import AnotherMessage from "./AnotherMessage";

const ChatMessages = () => {
    return(
        <div className="chat-messages-container">
            <MyMessage text={`مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان `} />
            <MyMessage text={`سسيسشيشسيشسيشسيشسيسسسسشييييييييييييييييييييييييييشسيشسيشسيشسيس`} />
            <MyMessage text={`مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان `} />
            <MessageInfo />

            <AnotherMessage text={`مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان `} />
            <AnotherMessage text={`مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان `} />
            <AnotherMessage text={`مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان `} />
            <AnotherMessage text={`مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان `} />
            <AnotherMessage text={`مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان `} />
            <AnotherMessage text={`مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان `} />
            <AnotherMessage text={`مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان `} />
            <AnotherMessage text={`مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان `} />
            <AnotherMessage text={`مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان مصطفى عصام جلال توفيق سالم سلامة شعبان `} />
        </div>
    )
}


export default ChatMessages;