
import Image from "next/image";
import BlogCover from '../../public/blog-cover.png';
import { FaUserDoctor, FaCalendar } from "react-icons/fa6";
import BlogOneImage from '../../public/blog1.jpg';
import BlogTwoImage from '../../public/blog2.jpg';
import BlogThreeImage from '../../public/blog3.webp';
import Link from "next/link";
import { NextSeo } from 'next-seo';


export async function getServerSideProps(context) {
    const { blog } = context.params;
    const formatted = blog.replace(/_/g, ' ');
  
    const getData = (param) => {
      switch (param) {
        case 'جهاز شد الفقرات الإلكتروني':
          return {
            title: 'جهاز شد الفقرات الإلكتروني',
            sections: [
              {
                header: 'مقدمة',
                content: 'تُعتبر آلام الظهر والعمود الفقري من المشاكل الصحية الشائعة التي تؤثر على جودة الحياة والنشاط اليومي للعديد من الأشخاص. يأتي جهاز شد الفقرات الإلكتروني كحل متطور وفعّال لتخفيف هذه الآلام وعلاج مشكلات العمود الفقري. يقدم مركز ريهاب للعلاج الطبيعي هذه التقنية الحديثة كجزء من خدماته المتخصصة، لضمان تقديم رعاية شاملة ومتكاملة للمرضى.',
              },
              {
                header: 'دور مركز ريهاب للعلاج الطبيعي',
                content: 'يقدم مركز ريهاب للعلاج الطبيعي خدمات علاجية متقدمة باستخدام جهاز شد الفقرات الإلكتروني. يضم المركز فريقًا من الأطباء والمعالجين الطبيعيين المتخصصين الذين يتمتعون بخبرة واسعة في استخدام هذه التقنية لتحسين صحة العمود الفقري وتخفيف الآلام. يهدف المركز إلى توفير رعاية متخصصة لكل مريض لتحقيق أفضل النتائج الممكنة.',
              },
              {
                header: 'كيف يعمل جهاز شد الفقرات الإلكتروني؟',
                subsections: [
                  {
                    subheader: 'الشد اللطيف والمستمر',
                    content: 'يعمل جهاز شد الفقرات الإلكتروني على تطبيق قوة شد لطيفة ومستدامة على العمود الفقري، مما يساعد في تقليل الضغط على الأقراص الفقرية وتخفيف الألم. يتم التحكم في قوة الشد ومدة العلاج بواسطة جهاز تحكم دقيق لضمان السلامة والراحة للمريض.',
                  },
                  {
                    subheader: 'تحسين تدفق الدم',
                    content: 'يساهم جهاز شد الفقرات الإلكتروني في تحسين تدفق الدم إلى المناطق المتضررة في العمود الفقري، مما يساعد في تسريع عملية الشفاء وتقليل الالتهاب. هذا يساعد على تعزيز صحة الأنسجة المحيطة وتحسين وظائف العمود الفقري.',
                  },
                  {
                    subheader: 'تقليل الضغط على الأعصاب',
                    content: 'يمكن أن يساهم جهاز شد الفقرات الإلكتروني في تقليل الضغط على الأعصاب التي قد تكون مضغوطة بسبب انزلاق الأقراص الفقرية أو مشاكل أخرى في العمود الفقري. هذا يمكن أن يؤدي إلى تخفيف الألم وتحسين القدرة على الحركة.',
                  },
                ],
              },
              {
                header: 'فوائد استخدام جهاز شد الفقرات الإلكتروني',
                content: [
                  'تخفيف الآلام بشكل فعال.',
                  'تحسين حركة العمود الفقري وزيادة المرونة.',
                  'تقليل الضغط على الأعصاب وتحسين وظائفها.',
                  'تحسين تدفق الدم وتعزيز عملية الشفاء.',
                  'عدم الحاجة إلى إجراءات جراحية أو فترة استشفاء طويلة.',
                ],
              },
              {
                header: 'قصص نجاح',
                content: 'لقد ساعد جهاز شد الفقرات الإلكتروني في مركز ريهاب للعلاج الطبيعي العديد من المرضى على تحقيق تحسن ملحوظ في حالتهم الصحية. بفضل هذه التقنية المتقدمة والدعم المستمر من الفريق الطبي، تمكن المرضى من تخفيف آلامهم واستعادة قدرتهم على الحركة والقيام بالأنشطة اليومية.',
              },
              {
                header: 'خاتمة',
                content: 'يُعد جهاز شد الفقرات الإلكتروني أحد الابتكارات الهامة في مجال علاج آلام الظهر والعمود الفقري. بزيارة مركز ريهاب للعلاج الطبيعي، يمكن للمرضى الاستفادة من هذه التقنية المتطورة والحصول على رعاية متخصصة وشاملة لتحسين صحة العمود الفقري وتخفيف الآلام. يقدم المركز برامج علاجية مخصصة لكل مريض، ويستخدم أحدث التقنيات والأساليب لضمان تحقيق أفضل النتائج الممكنة.',
              },
            ],
            tags: ['جهاز شد الفقرات الإلكتروني', 'علاج آلام الظهر', 'علاج مشاكل العمود الفقري', 'تخفيف آلام الظهر', 'شد الفقرات', 'تحسين صحة العمود الفقري', 'علاج طبيعي للعمود الفقري', 'تقنيات علاج الفقرات', 'علاج العمود الفقري بدون جراحة', 'جهاز شد الفقرات في مركز ريهاب', 'تحسين حركة العمود الفقري', 'تقليل الضغط على الأعصاب', 'تعزيز تدفق الدم للعمود الفقري', 'علاج التهاب الفقرات', 'فوائد جهاز شد الفقرات',],
          };
          case 'تأهيل حالات الرباط الصليبي قبل وبعد العملية':
            return {
              title: 'تأهيل حالات الرباط الصليبي قبل وبعد العملية',
              sections: [
                {
                  header: 'مقدمة',
                  content: 'إصابة الرباط الصليبي تُعتبر من الإصابات الشائعة بين الرياضيين والأشخاص النشطين جسديًا، وتؤثر بشكل كبير على الحركة والأداء البدني. تأهيل حالات الرباط الصليبي قبل وبعد العملية يلعب دورًا حاسمًا في تسريع عملية الشفاء واستعادة الوظائف الطبيعية للركبة. يقدم مركز ريهاب للعلاج الطبيعي خدمات متخصصة لتأهيل هذه الحالات، باستخدام أحدث التقنيات والأساليب العلاجية.',
                },
                {
                  header: 'دور مركز ريهاب للعلاج الطبيعي',
                  content: 'يقدم مركز ريهاب للعلاج الطبيعي برامج تأهيل شاملة ومخصصة للأشخاص الذين يعانون من إصابات الرباط الصليبي. يعمل الفريق الطبي المتخصص في المركز على تقديم رعاية مهنية ومتكاملة للمرضى، من خلال مراحل التأهيل المختلفة قبل وبعد العملية الجراحية.',
                },
                {
                  header: 'تأهيل حالات الرباط الصليبي قبل العملية',
                  subsections: [
                    {
                      subheader: 'تقوية العضلات',
                      content: 'يهدف التأهيل قبل العملية إلى تقوية العضلات المحيطة بالركبة، مثل عضلات الفخذ والربلة، لتحسين استقرار الركبة وتخفيف الضغط على الرباط المصاب. يشمل البرنامج التدريبي تمارين تقوية وتمارين توازن وتحمل.',
                    },
                    {
                      subheader: 'تحسين نطاق الحركة',
                      content: 'يساعد العلاج الطبيعي قبل العملية في تحسين نطاق حركة الركبة، مما يسهم في تحقيق نتائج أفضل بعد العملية. تُستخدم تقنيات التمدد وتمارين الحركة النشطة لتحقيق هذا الهدف.',
                    },
                    {
                      subheader: 'تقليل التورم والألم',
                      content: 'تشمل برامج التأهيل تقنيات لتقليل التورم والألم، مثل العلاج بالثلج والضغط والتدليك، مما يساعد على تحسين حالة الركبة قبل العملية.',
                    },
                  ],
                },
                {
                  header: 'تأهيل حالات الرباط الصليبي بعد العملية',
                  subsections: [
                    {
                      subheader: 'المرحلة الأولى: الاستشفاء المبكر',
                      content: 'تشمل هذه المرحلة تقنيات لتقليل التورم والألم، مثل العلاج بالثلج، واستخدام الضمادات الضاغطة، ورفع الساق. تهدف هذه المرحلة إلى حماية الركبة ومنع حدوث مضاعفات.',
                    },
                    {
                      subheader: 'المرحلة الثانية: استعادة الحركة',
                      content: 'تبدأ في هذه المرحلة تدريبات خفيفة لاستعادة نطاق حركة الركبة، مع التركيز على التمارين التي لا تضع ضغطًا كبيرًا على الرباط المصلح حديثًا. تشمل هذه التمارين حركات ثني ومد الركبة وتمارين التوازن الخفيفة.',
                    },
                    {
                      subheader: 'المرحلة الثالثة: تقوية العضلات',
                      content: 'تشمل هذه المرحلة تدريبات تقوية العضلات المحيطة بالركبة، مثل عضلات الفخذ والربلة، باستخدام تمارين مقاومة معتدلة. الهدف هو استعادة القوة والقدرة على التحمل في العضلات لدعم الركبة بشكل أفضل.',
                    },
                    {
                      subheader: 'المرحلة الرابعة: العودة إلى النشاط',
                      content: 'تشمل هذه المرحلة تدريبات متقدمة تهدف إلى استعادة القدرة على القيام بالأنشطة اليومية والرياضية بشكل تدريجي وآمن. يتم تصميم البرنامج ليتناسب مع احتياجات وأهداف كل مريض، مع مراعاة منع الإصابات المستقبلية.',
                    },
                  ],
                },
                {
                  header: 'فوائد التأهيل في مركز ريهاب للعلاج الطبيعي',
                  content: [
                    'تقليل الألم والتورم بشكل فعال.',
                    'استعادة نطاق الحركة الطبيعي للركبة.',
                    'تقوية العضلات المحيطة بالركبة.',
                    'تحسين التوازن والاستقرار.',
                    'تسريع عملية الشفاء والعودة إلى النشاط الطبيعي.',
                  ],
                },
                {
                  header: 'قصص نجاح',
                  content: 'لقد ساعد مركز ريهاب للعلاج الطبيعي العديد من المرضى على تحقيق تعافي كامل وناجح من إصابات الرباط الصليبي. بفضل البرامج العلاجية المتخصصة والدعم المستمر من الفريق الطبي، تمكن هؤلاء المرضى من استعادة وظائف ركبتهم والعودة إلى أنشطتهم اليومية والرياضية.',
                },
                {
                  header: 'خاتمة',
                  content: 'يُعتبر تأهيل حالات الرباط الصليبي قبل وبعد العملية أمرًا حيويًا لتحقيق شفاء كامل واستعادة الحركة الطبيعية. يقدم مركز ريهاب للعلاج الطبيعي برامج تأهيل شاملة ومخصصة لكل مريض، باستخدام أحدث التقنيات والأساليب لضمان تحقيق أفضل النتائج الممكنة. يمكن للمرضى الذين يعانون من إصابات الرباط الصليبي زيارة المركز للحصول على رعاية متخصصة وشاملة تساعدهم على استعادة صحتهم ونشاطهم.',
                },
              ],
              tags: ['تأهيل الرباط الصليبي', 'علاج الرباط الصليبي', 'تأهيل قبل العملية', 'تأهيل بعد العملية', 'علاج طبيعي للركبة', 'تحسين حركة الركبة', 'تقوية عضلات الركبة', 'استعادة الحركة بعد العملية', 'التأهيل في مركز ريهاب', 'إصابات الركبة', 'العلاج الطبيعي للرياضيين', 'تقنيات التأهيل الحديثة', 'تمارين تقوية الركبة', 'فوائد التأهيل البدني', 'قصص نجاح في التأهيل',],
            };
            case 'تأهيل حالات ما بعد الجلطات':
              return {
                title: 'تأهيل حالات ما بعد الجلطات',
                sections: [
                  {
                    header: 'مقدمة',
                    content: 'تُعد الجلطات من الحالات الطبية الطارئة التي تتطلب تدخلاً سريعاً وفعّالاً لإنقاذ حياة المريض وتقليل الأضرار الناجمة عنها. بعد التعافي من الجلطة، يكون التأهيل الطبيعي أمراً ضرورياً لاستعادة الوظائف الحركية وتحسين جودة الحياة. يُقدّم مركز ريهاب للعلاج الطبيعي برامج تأهيل شاملة ومخصصة للأشخاص الذين يعانون من آثار ما بعد الجلطات، باستخدام أحدث التقنيات والأساليب العلاجية.',
                  },
                  {
                    header: 'دور مركز ريهاب للعلاج الطبيعي',
                    content: 'يقدم مركز ريهاب للعلاج الطبيعي خدمات متخصصة لتأهيل حالات ما بعد الجلطات، بالاعتماد على فريق من الأطباء والمعالجين الطبيعيين ذوي الخبرة. يهدف المركز إلى تقديم رعاية شاملة ومتكاملة تساعد المرضى على استعادة وظائفهم الحركية وتحسين قدراتهم على القيام بالأنشطة اليومية.',
                  },
                  {
                    header: 'أهداف تأهيل حالات ما بعد الجلطات',
                    subsections: [
                      {
                        subheader: 'استعادة الحركة',
                        content: 'يهدف التأهيل إلى تحسين القدرة على الحركة والتنقل، من خلال تقوية العضلات وتحسين التوازن والتنسيق. يشمل البرنامج التدريبي تمارين مخصصة لتحسين حركة الأطراف واستعادة القدرة على المشي.',
                      },
                      {
                        subheader: 'تحسين الوظائف اليومية',
                        content: 'يسعى التأهيل إلى مساعدة المرضى في استعادة قدرتهم على القيام بالأنشطة اليومية مثل الأكل، والشرب، واللباس، والاستحمام. يتم ذلك من خلال تدريبات مخصصة لتحسين القدرة على القيام بهذه الأنشطة بشكل مستقل.',
                      },
                      {
                        subheader: 'تعزيز التوازن والتنسيق',
                        content: 'تشمل برامج التأهيل تمارين لتحسين التوازن والتنسيق، مما يساعد في منع السقوط والإصابات الناتجة عنه. يتم استخدام تقنيات متنوعة لتحقيق هذا الهدف، مثل التمارين الحركية والتوازن الثابت والديناميكي.',
                      },
                      {
                        subheader: 'تحسين القدرة على الكلام والبلع',
                        content: 'قد يعاني بعض المرضى من مشاكل في الكلام والبلع بعد الجلطة. يقدّم المركز تدريبات مخصصة لتحسين القدرة على النطق والتحدث بشكل واضح، وكذلك تمارين لتحسين قدرة البلع.',
                      },
                    ],
                  },
                  {
                    header: 'مراحل تأهيل حالات ما بعد الجلطات في مركز ريهاب',
                    subsections: [
                      {
                        subheader: 'المرحلة الأولى: التقييم الشامل',
                        content: 'تشمل هذه المرحلة إجراء تقييم شامل لحالة المريض من قبل فريق من الأطباء والمعالجين الطبيعيين، لتحديد الاحتياجات العلاجية ووضع خطة تأهيل مخصصة. يتم تقييم القوة العضلية، ونطاق الحركة، والتوازن، والقدرات الوظيفية.',
                      },
                      {
                        subheader: 'المرحلة الثانية: العلاج الحركي',
                        content: 'تشمل هذه المرحلة تدريبات مخصصة لتحسين القدرة على الحركة والتنقل. يتم استخدام تمارين تقوية العضلات، وتمارين التوازن، وتمارين التنسيق لتحسين وظائف الأطراف واستعادة القدرة على المشي.',
                      },
                      {
                        subheader: 'المرحلة الثالثة: العلاج الوظيفي',
                        content: 'تركّز هذه المرحلة على تحسين القدرة على القيام بالأنشطة اليومية. يتم تقديم تدريبات مخصصة لتحسين القدرات الوظيفية واستعادة الاستقلالية في القيام بالأنشطة اليومية.',
                      },
                      {
                        subheader: 'المرحلة الرابعة: العلاج اللغوي والبلع',
                        content: 'تشمل هذه المرحلة تدريبات لتحسين القدرة على النطق والكلام، وكذلك تمارين لتحسين قدرة البلع. يتم تقديم تدريبات مخصصة لمساعدة المرضى على استعادة القدرة على التحدث بشكل واضح والبلع بشكل طبيعي.',
                      },
                    ],
                  },
                  {
                    header: 'فوائد التأهيل في مركز ريهاب للعلاج الطبيعي',
                    content: [
                      'استعادة الحركة والقدرة على التنقل بشكل أفضل.',
                      'تحسين القدرة على القيام بالأنشطة اليومية بشكل مستقل.',
                      'تعزيز التوازن والتنسيق لمنع السقوط.',
                      'تحسين القدرة على النطق والبلع.',
                      'تحسين جودة الحياة بشكل عام.',
                    ],
                  },
                  {
                    header: 'قصص نجاح',
                    content: 'لقد ساعد مركز ريهاب للعلاج الطبيعي العديد من المرضى على تحقيق تقدم كبير في تأهيل حالات ما بعد الجلطات. بفضل البرامج العلاجية المتخصصة والدعم المستمر من الفريق الطبي، تمكن هؤلاء المرضى من استعادة وظائفهم الحركية وتحسين قدرتهم على القيام بالأنشطة اليومية.',
                  },
                  {
                    header: 'خاتمة',
                    content: 'يُعد تأهيل حالات ما بعد الجلطات أمراً حيوياً لتحقيق تعافٍ كامل واستعادة القدرة على القيام بالأنشطة اليومية بشكل مستقل. يقدم مركز ريهاب للعلاج الطبيعي برامج تأهيل شاملة ومخصصة لكل مريض، باستخدام أحدث التقنيات والأساليب لضمان تحقيق أفضل النتائج الممكنة. يمكن للمرضى الذين يعانون من آثار ما بعد الجلطات زيارة المركز للحصول على رعاية متخصصة وشاملة تساعدهم على تحسين جودة حياتهم واستعادة وظائفهم الحركية.',
                  },
                ],
                tags: ['تأهيل حالات ما بعد الجلطات', 'علاج ما بعد الجلطات', 'تأهيل الجلطات', 'استعادة الحركة بعد الجلطة', 'تحسين الكلام بعد الجلطة', 'تحسين البلع بعد الجلطة', 'التأهيل في مركز ريهاب', 'التوازن بعد الجلطة', 'النطق بعد الجلطة', 'العلاج الطبيعي بعد الجلطة', 'تمارين ما بعد الجلطة', 'قصص نجاح في التأهيل', 'تحسين جودة الحياة بعد الجلطة',],
              };
        default:
          return {};
      }
    };
  
    const data = getData(formatted);
  
    return { props: { data } };
  }
  


const BlogPost = ({ data }) => {

    const imgs = {
        'جهاز شد الفقرات الإلكتروني': BlogOneImage.src,
        'تأهيل حالات الرباط الصليبي قبل وبعد العملية': BlogTwoImage.src,
        'تأهيل حالات ما بعد الجلطات': BlogThreeImage.src
    }

    return (
        <div className="blog-page-container">

          <NextSeo title={data.title + ' - ' + "مركز ريهاب للعلاج الطبيعي والتأهيل"} />

            <div className="blog-page-intro">
                <div className="img-container"><Image src={BlogCover.src} fill style={{objectFit: 'cover'}} alt="Rehab EG Center"></Image></div>
                <div className="layer-on">
                    <h1>تفاصيل المدونة</h1>
                </div>
            </div>


            <div className="blog-page-second-container">

                <div className="blogs-tags">

                    <h2>احدث المدونات</h2>

                    <div className="recent-blogs">

                        <div className="blog">
                            <div className="img-container"><Image sizes="(min-width: 2060px) 190px, (min-width: 1720px) 180px, (min-width: 1540px) 150px, (min-width: 640px) 130px, calc(10.94vw + 62px)" loading="lazy" src={BlogThreeImage.src} fill style={{objectFit: 'cover'}} alt="Rehab EG Clinic"></Image></div>
                            <div className="blog-info">
                             <Link href="/blog/تأهيل_حالات_ما_بعد_الجلطات" title="تأهيل حالات ما بعد الجلطات">تأهيل حالات ما بعد الجلطات</Link>
                             <div className="bottom-blog-info">
                                <p><FaUserDoctor className="icon" />مسؤول</p>
                                <p><FaCalendar className="icon" /> 21-7-2024</p>
                             </div>
                            </div>
                        </div>


                        <div className="blog">
                            <div className="img-container"><Image sizes="(min-width: 2060px) 190px, (min-width: 1720px) 180px, (min-width: 1540px) 150px, (min-width: 640px) 130px, calc(10.94vw + 62px)" loading="lazy" src={BlogTwoImage.src} fill style={{objectFit: 'cover'}} alt="Rehab EG Clinic"></Image></div>
                            <div className="blog-info">
                             <Link href="/blog/تأهيل_حالات_الرباط_الصليبي_قبل_وبعد_العملية" title="تأهيل حالات الرباط الصليبي قبل وبعد العملية">تأهيل حالات الرباط الصليبي قبل وبعد العملية</Link>
                             <div className="bottom-blog-info">
                                <p><FaUserDoctor className="icon" />مسؤول</p>
                                <p><FaCalendar className="icon" /> 21-7-2024</p>
                             </div>
                            </div>
                        </div>

                        <div className="blog">
                            <div className="img-container"><Image sizes="(min-width: 2060px) 190px, (min-width: 1720px) 180px, (min-width: 1540px) 150px, (min-width: 640px) 130px, calc(10.94vw + 62px)" loading="lazy" src={BlogOneImage.src} fill style={{objectFit: 'cover'}} alt="Rehab EG Clinic"></Image></div>
                            <div className="blog-info">
                             <Link href={`/blog/جهاز_شد_الفقرات_الإلكتروني`} title="جهاز شد الفقرات الإلكتروني">جهاز شد الفقرات الإلكتروني</Link>
                             <div className="bottom-blog-info">
                                <p><FaUserDoctor className="icon" />مسؤول</p>
                                <p><FaCalendar className="icon" /> 21-7-2024</p>
                             </div>
                            </div>
                        </div>

                    </div>

                    <h2>العلامات</h2>

                    <div className="tags">
                        {data.tags.map((e, key) => {
                            return(
                                <h3 key={key} title={e}>{e}</h3>
                            )
                        })}
                    </div>

                </div>


                <div className="blog-page-info">

                <div className="img-container"><Image sizes="(min-width: 1120px) 48.99vw, 70vw" src={imgs[data.title]} fill style={{objectFit: 'cover'}} alt="First Rehab EG Clinic"></Image></div>
                {data.title && <h1>{data.title}</h1>}
                {data.sections && data.sections.map((section, index) => (
                <div key={index}>
                    {section.header && <h2>{section.header}</h2>}
                    {Array.isArray(section.content) ? (
                    <ul>
                        {section.content.map((item, idx) => (
                        <li key={idx}>{item}</li>
                        ))}
                    </ul>
                    ) : (
                    <p>{section.content}</p>
                    )}
                    {section.subsections && section.subsections.map((subsection, subIndex) => (
                    <div key={subIndex}>
                        <h3>{subsection.subheader}</h3>
                        <p>{subsection.content}</p>
                    </div>
                    ))}
                </div>
                ))}
                </div>


            </div>



        </div>
    );
  };
  
  export default BlogPost;
  